ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_smif.h
/***************************************************************************//**
* \file cyip_smif.h
*
* \brief
* SMIF IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_SMIF_H_
#define _CYIP_SMIF_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                           SMIF                                            ================ */
/* =========================================================================================================================== */

#define SMIF_DEVICE_SECTION_SIZE    0x00000080UL
#define SMIF_SECTION_SIZE           0x00010000UL

/**
  * \brief Device (only used in XIP mode) (SMIF_DEVICE)
  */
typedef struct {
  __IOM uint32_t CTL;                           /*!< 0x00000000 Control                                                        */
   __IM uint32_t RESERVED;
  __IOM uint32_t ADDR;                          /*!< 0x00000008 Device region base address                                     */
  __IOM uint32_t MASK;                          /*!< 0x0000000C Device region mask                                             */
   __IM uint32_t RESERVED1[4];
  __IOM uint32_t ADDR_CTL;                      /*!< 0x00000020 Address control                                                */
   __IM uint32_t RESERVED2[7];
  __IOM uint32_t RD_CMD_CTL;                    /*!< 0x00000040 Read command control                                           */
  __IOM uint32_t RD_ADDR_CTL;                   /*!< 0x00000044 Read address control                                           */
  __IOM uint32_t RD_MODE_CTL;                   /*!< 0x00000048 Read mode control                                              */
  __IOM uint32_t RD_DUMMY_CTL;                  /*!< 0x0000004C Read dummy control                                             */
  __IOM uint32_t RD_DATA_CTL;                   /*!< 0x00000050 Read data control                                              */
   __IM uint32_t RESERVED3[3];
  __IOM uint32_t WR_CMD_CTL;                    /*!< 0x00000060 Write command control                                          */
  __IOM uint32_t WR_ADDR_CTL;                   /*!< 0x00000064 Write address control                                          */
  __IOM uint32_t WR_MODE_CTL;                   /*!< 0x00000068 Write mode control                                             */
  __IOM uint32_t WR_DUMMY_CTL;                  /*!< 0x0000006C Write dummy control                                            */
  __IOM uint32_t WR_DATA_CTL;                   /*!< 0x00000070 Write data control                                             */
   __IM uint32_t RESERVED4[3];
} SMIF_DEVICE_Type;                             /*!< Size = 116 (0x74)                                                         */

/**
  * \brief Serial Memory Interface (SMIF)
  */
typedef struct {                                /*!< SMIF Structure                                                            */
  __IOM uint32_t CTL;                           /*!< 0x00000000 Control                                                        */
   __IM uint32_t STATUS;                        /*!< 0x00000004 Status                                                         */
   __IM uint32_t RESERVED[15];
   __IM uint32_t TX_CMD_FIFO_STATUS;            /*!< 0x00000044 Transmitter command FIFO status                                */
   __IM uint32_t RESERVED1[2];
   __OM uint32_t TX_CMD_FIFO_WR;                /*!< 0x00000050 Transmitter command FIFO write                                 */
   __IM uint32_t RESERVED2[11];
  __IOM uint32_t TX_DATA_FIFO_CTL;              /*!< 0x00000080 Transmitter data FIFO control                                  */
   __IM uint32_t TX_DATA_FIFO_STATUS;           /*!< 0x00000084 Transmitter data FIFO status                                   */
   __IM uint32_t RESERVED3[2];
   __OM uint32_t TX_DATA_FIFO_WR1;              /*!< 0x00000090 Transmitter data FIFO write                                    */
   __OM uint32_t TX_DATA_FIFO_WR2;              /*!< 0x00000094 Transmitter data FIFO write                                    */
   __OM uint32_t TX_DATA_FIFO_WR4;              /*!< 0x00000098 Transmitter data FIFO write                                    */
   __IM uint32_t RESERVED4[9];
  __IOM uint32_t RX_DATA_FIFO_CTL;              /*!< 0x000000C0 Receiver data FIFO control                                     */
   __IM uint32_t RX_DATA_FIFO_STATUS;           /*!< 0x000000C4 Receiver data FIFO status                                      */
   __IM uint32_t RESERVED5[2];
   __IM uint32_t RX_DATA_FIFO_RD1;              /*!< 0x000000D0 Receiver data FIFO read                                        */
   __IM uint32_t RX_DATA_FIFO_RD2;              /*!< 0x000000D4 Receiver data FIFO read                                        */
   __IM uint32_t RX_DATA_FIFO_RD4;              /*!< 0x000000D8 Receiver data FIFO read                                        */
   __IM uint32_t RESERVED6;
   __IM uint32_t RX_DATA_FIFO_RD1_SILENT;       /*!< 0x000000E0 Receiver data FIFO silent read                                 */
   __IM uint32_t RESERVED7[7];
  __IOM uint32_t SLOW_CA_CTL;                   /*!< 0x00000100 Slow cache control                                             */
   __IM uint32_t RESERVED8;
  __IOM uint32_t SLOW_CA_CMD;                   /*!< 0x00000108 Slow cache command                                             */
   __IM uint32_t RESERVED9[13];
   __IM uint32_t SLOW_CA_STATUS0;               /*!< 0x00000140 Slow cache status 0                                            */
   __IM uint32_t SLOW_CA_STATUS1;               /*!< 0x00000144 Slow cache status 1                                            */
   __IM uint32_t SLOW_CA_STATUS2;               /*!< 0x00000148 Slow cache status 2                                            */
   __IM uint32_t RESERVED10[13];
  __IOM uint32_t FAST_CA_CTL;                   /*!< 0x00000180 Fast cache control                                             */
   __IM uint32_t RESERVED11;
  __IOM uint32_t FAST_CA_CMD;                   /*!< 0x00000188 Fast cache command                                             */
   __IM uint32_t RESERVED12[13];
   __IM uint32_t FAST_CA_STATUS0;               /*!< 0x000001C0 Fast cache status 0                                            */
   __IM uint32_t FAST_CA_STATUS1;               /*!< 0x000001C4 Fast cache status 1                                            */
   __IM uint32_t FAST_CA_STATUS2;               /*!< 0x000001C8 Fast cache status 2                                            */
   __IM uint32_t RESERVED13[13];
  __IOM uint32_t CRYPTO_CMD;                    /*!< 0x00000200 Cryptography Command                                           */
   __IM uint32_t RESERVED14[7];
  __IOM uint32_t CRYPTO_INPUT0;                 /*!< 0x00000220 Cryptography input 0                                           */
  __IOM uint32_t CRYPTO_INPUT1;                 /*!< 0x00000224 Cryptography input 1                                           */
  __IOM uint32_t CRYPTO_INPUT2;                 /*!< 0x00000228 Cryptography input 2                                           */
  __IOM uint32_t CRYPTO_INPUT3;                 /*!< 0x0000022C Cryptography input 3                                           */
   __IM uint32_t RESERVED15[4];
   __OM uint32_t CRYPTO_KEY0;                   /*!< 0x00000240 Cryptography key 0                                             */
   __OM uint32_t CRYPTO_KEY1;                   /*!< 0x00000244 Cryptography key 1                                             */
   __OM uint32_t CRYPTO_KEY2;                   /*!< 0x00000248 Cryptography key 2                                             */
   __OM uint32_t CRYPTO_KEY3;                   /*!< 0x0000024C Cryptography key 3                                             */
   __IM uint32_t RESERVED16[4];
  __IOM uint32_t CRYPTO_OUTPUT0;                /*!< 0x00000260 Cryptography output 0                                          */
  __IOM uint32_t CRYPTO_OUTPUT1;                /*!< 0x00000264 Cryptography output 1                                          */
  __IOM uint32_t CRYPTO_OUTPUT2;                /*!< 0x00000268 Cryptography output 2                                          */
  __IOM uint32_t CRYPTO_OUTPUT3;                /*!< 0x0000026C Cryptography output 3                                          */
   __IM uint32_t RESERVED17[340];
  __IOM uint32_t INTR;                          /*!< 0x000007C0 Interrupt register                                             */
  __IOM uint32_t INTR_SET;                      /*!< 0x000007C4 Interrupt set register                                         */
  __IOM uint32_t INTR_MASK;                     /*!< 0x000007C8 Interrupt mask register                                        */
   __IM uint32_t INTR_MASKED;                   /*!< 0x000007CC Interrupt masked register                                      */
   __IM uint32_t RESERVED18[12];
        SMIF_DEVICE_Type DEVICE[4];             /*!< 0x00000800 Device (only used in XIP mode)                                 */
} SMIF_Type;                                    /*!< Size = 2560 (0xA00)                                                       */


/* ====================================================  SMIF_DEVICE.CTL  ==================================================== */
#define SMIF_DEVICE_CTL_WR_EN_Pos         (0UL)                 /*!< SMIF_DEVICE CTL: WR_EN (Bit 0)                            */
#define SMIF_DEVICE_CTL_WR_EN_Msk         (0x1UL)               /*!< SMIF_DEVICE CTL: WR_EN (Bitfield-Mask: 0x01)              */
#define SMIF_DEVICE_CTL_CRYPTO_EN_Pos     (8UL)                 /*!< SMIF_DEVICE CTL: CRYPTO_EN (Bit 8)                        */
#define SMIF_DEVICE_CTL_CRYPTO_EN_Msk     (0x100UL)             /*!< SMIF_DEVICE CTL: CRYPTO_EN (Bitfield-Mask: 0x01)          */
#define SMIF_DEVICE_CTL_DATA_SEL_Pos      (16UL)                /*!< SMIF_DEVICE CTL: DATA_SEL (Bit 16)                        */
#define SMIF_DEVICE_CTL_DATA_SEL_Msk      (0x30000UL)           /*!< SMIF_DEVICE CTL: DATA_SEL (Bitfield-Mask: 0x03)           */
#define SMIF_DEVICE_CTL_ENABLED_Pos       (31UL)                /*!< SMIF_DEVICE CTL: ENABLED (Bit 31)                         */
#define SMIF_DEVICE_CTL_ENABLED_Msk       (0x80000000UL)        /*!< SMIF_DEVICE CTL: ENABLED (Bitfield-Mask: 0x01)            */
/* ===================================================  SMIF_DEVICE.ADDR  ==================================================== */
#define SMIF_DEVICE_ADDR_ADDR_Pos         (8UL)                 /*!< SMIF_DEVICE ADDR: ADDR (Bit 8)                            */
#define SMIF_DEVICE_ADDR_ADDR_Msk         (0xffffff00UL)        /*!< SMIF_DEVICE ADDR: ADDR (Bitfield-Mask: 0xffffff)          */
/* ===================================================  SMIF_DEVICE.MASK  ==================================================== */
#define SMIF_DEVICE_MASK_MASK_Pos         (8UL)                 /*!< SMIF_DEVICE MASK: MASK (Bit 8)                            */
#define SMIF_DEVICE_MASK_MASK_Msk         (0xffffff00UL)        /*!< SMIF_DEVICE MASK: MASK (Bitfield-Mask: 0xffffff)          */
/* =================================================  SMIF_DEVICE.ADDR_CTL  ================================================== */
#define SMIF_DEVICE_ADDR_CTL_SIZE2_Pos    (0UL)                 /*!< SMIF_DEVICE ADDR_CTL: SIZE2 (Bit 0)                       */
#define SMIF_DEVICE_ADDR_CTL_SIZE2_Msk    (0x3UL)               /*!< SMIF_DEVICE ADDR_CTL: SIZE2 (Bitfield-Mask: 0x03)         */
#define SMIF_DEVICE_ADDR_CTL_DIV2_Pos     (8UL)                 /*!< SMIF_DEVICE ADDR_CTL: DIV2 (Bit 8)                        */
#define SMIF_DEVICE_ADDR_CTL_DIV2_Msk     (0x100UL)             /*!< SMIF_DEVICE ADDR_CTL: DIV2 (Bitfield-Mask: 0x01)          */
/* ================================================  SMIF_DEVICE.RD_CMD_CTL  ================================================= */
#define SMIF_DEVICE_RD_CMD_CTL_CODE_Pos   (0UL)                 /*!< SMIF_DEVICE RD_CMD_CTL: CODE (Bit 0)                      */
#define SMIF_DEVICE_RD_CMD_CTL_CODE_Msk   (0xffUL)              /*!< SMIF_DEVICE RD_CMD_CTL: CODE (Bitfield-Mask: 0xff)        */
#define SMIF_DEVICE_RD_CMD_CTL_WIDTH_Pos  (16UL)                /*!< SMIF_DEVICE RD_CMD_CTL: WIDTH (Bit 16)                    */
#define SMIF_DEVICE_RD_CMD_CTL_WIDTH_Msk  (0x30000UL)           /*!< SMIF_DEVICE RD_CMD_CTL: WIDTH (Bitfield-Mask: 0x03)       */
#define SMIF_DEVICE_RD_CMD_CTL_PRESENT_Pos (31UL)               /*!< SMIF_DEVICE RD_CMD_CTL: PRESENT (Bit 31)                  */
#define SMIF_DEVICE_RD_CMD_CTL_PRESENT_Msk (0x80000000UL)       /*!< SMIF_DEVICE RD_CMD_CTL: PRESENT (Bitfield-Mask: 0x01)     */
/* ================================================  SMIF_DEVICE.RD_ADDR_CTL  ================================================ */
#define SMIF_DEVICE_RD_ADDR_CTL_WIDTH_Pos (16UL)                /*!< SMIF_DEVICE RD_ADDR_CTL: WIDTH (Bit 16)                   */
#define SMIF_DEVICE_RD_ADDR_CTL_WIDTH_Msk (0x30000UL)           /*!< SMIF_DEVICE RD_ADDR_CTL: WIDTH (Bitfield-Mask: 0x03)      */
/* ================================================  SMIF_DEVICE.RD_MODE_CTL  ================================================ */
#define SMIF_DEVICE_RD_MODE_CTL_CODE_Pos  (0UL)                 /*!< SMIF_DEVICE RD_MODE_CTL: CODE (Bit 0)                     */
#define SMIF_DEVICE_RD_MODE_CTL_CODE_Msk  (0xffUL)              /*!< SMIF_DEVICE RD_MODE_CTL: CODE (Bitfield-Mask: 0xff)       */
#define SMIF_DEVICE_RD_MODE_CTL_WIDTH_Pos (16UL)                /*!< SMIF_DEVICE RD_MODE_CTL: WIDTH (Bit 16)                   */
#define SMIF_DEVICE_RD_MODE_CTL_WIDTH_Msk (0x30000UL)           /*!< SMIF_DEVICE RD_MODE_CTL: WIDTH (Bitfield-Mask: 0x03)      */
#define SMIF_DEVICE_RD_MODE_CTL_PRESENT_Pos (31UL)              /*!< SMIF_DEVICE RD_MODE_CTL: PRESENT (Bit 31)                 */
#define SMIF_DEVICE_RD_MODE_CTL_PRESENT_Msk (0x80000000UL)      /*!< SMIF_DEVICE RD_MODE_CTL: PRESENT (Bitfield-Mask: 0x01)    */
/* ===============================================  SMIF_DEVICE.RD_DUMMY_CTL  ================================================ */
#define SMIF_DEVICE_RD_DUMMY_CTL_SIZE5_Pos (0UL)                /*!< SMIF_DEVICE RD_DUMMY_CTL: SIZE5 (Bit 0)                   */
#define SMIF_DEVICE_RD_DUMMY_CTL_SIZE5_Msk (0x1fUL)             /*!< SMIF_DEVICE RD_DUMMY_CTL: SIZE5 (Bitfield-Mask: 0x1f)     */
#define SMIF_DEVICE_RD_DUMMY_CTL_PRESENT_Pos (31UL)             /*!< SMIF_DEVICE RD_DUMMY_CTL: PRESENT (Bit 31)                */
#define SMIF_DEVICE_RD_DUMMY_CTL_PRESENT_Msk (0x80000000UL)     /*!< SMIF_DEVICE RD_DUMMY_CTL: PRESENT (Bitfield-Mask: 0x01)   */
/* ================================================  SMIF_DEVICE.RD_DATA_CTL  ================================================ */
#define SMIF_DEVICE_RD_DATA_CTL_WIDTH_Pos (16UL)                /*!< SMIF_DEVICE RD_DATA_CTL: WIDTH (Bit 16)                   */
#define SMIF_DEVICE_RD_DATA_CTL_WIDTH_Msk (0x30000UL)           /*!< SMIF_DEVICE RD_DATA_CTL: WIDTH (Bitfield-Mask: 0x03)      */
/* ================================================  SMIF_DEVICE.WR_CMD_CTL  ================================================= */
#define SMIF_DEVICE_WR_CMD_CTL_CODE_Pos   (0UL)                 /*!< SMIF_DEVICE WR_CMD_CTL: CODE (Bit 0)                      */
#define SMIF_DEVICE_WR_CMD_CTL_CODE_Msk   (0xffUL)              /*!< SMIF_DEVICE WR_CMD_CTL: CODE (Bitfield-Mask: 0xff)        */
#define SMIF_DEVICE_WR_CMD_CTL_WIDTH_Pos  (16UL)                /*!< SMIF_DEVICE WR_CMD_CTL: WIDTH (Bit 16)                    */
#define SMIF_DEVICE_WR_CMD_CTL_WIDTH_Msk  (0x30000UL)           /*!< SMIF_DEVICE WR_CMD_CTL: WIDTH (Bitfield-Mask: 0x03)       */
#define SMIF_DEVICE_WR_CMD_CTL_PRESENT_Pos (31UL)               /*!< SMIF_DEVICE WR_CMD_CTL: PRESENT (Bit 31)                  */
#define SMIF_DEVICE_WR_CMD_CTL_PRESENT_Msk (0x80000000UL)       /*!< SMIF_DEVICE WR_CMD_CTL: PRESENT (Bitfield-Mask: 0x01)     */
/* ================================================  SMIF_DEVICE.WR_ADDR_CTL  ================================================ */
#define SMIF_DEVICE_WR_ADDR_CTL_WIDTH_Pos (16UL)                /*!< SMIF_DEVICE WR_ADDR_CTL: WIDTH (Bit 16)                   */
#define SMIF_DEVICE_WR_ADDR_CTL_WIDTH_Msk (0x30000UL)           /*!< SMIF_DEVICE WR_ADDR_CTL: WIDTH (Bitfield-Mask: 0x03)      */
/* ================================================  SMIF_DEVICE.WR_MODE_CTL  ================================================ */
#define SMIF_DEVICE_WR_MODE_CTL_CODE_Pos  (0UL)                 /*!< SMIF_DEVICE WR_MODE_CTL: CODE (Bit 0)                     */
#define SMIF_DEVICE_WR_MODE_CTL_CODE_Msk  (0xffUL)              /*!< SMIF_DEVICE WR_MODE_CTL: CODE (Bitfield-Mask: 0xff)       */
#define SMIF_DEVICE_WR_MODE_CTL_WIDTH_Pos (16UL)                /*!< SMIF_DEVICE WR_MODE_CTL: WIDTH (Bit 16)                   */
#define SMIF_DEVICE_WR_MODE_CTL_WIDTH_Msk (0x30000UL)           /*!< SMIF_DEVICE WR_MODE_CTL: WIDTH (Bitfield-Mask: 0x03)      */
#define SMIF_DEVICE_WR_MODE_CTL_PRESENT_Pos (31UL)              /*!< SMIF_DEVICE WR_MODE_CTL: PRESENT (Bit 31)                 */
#define SMIF_DEVICE_WR_MODE_CTL_PRESENT_Msk (0x80000000UL)      /*!< SMIF_DEVICE WR_MODE_CTL: PRESENT (Bitfield-Mask: 0x01)    */
/* ===============================================  SMIF_DEVICE.WR_DUMMY_CTL  ================================================ */
#define SMIF_DEVICE_WR_DUMMY_CTL_SIZE5_Pos (0UL)                /*!< SMIF_DEVICE WR_DUMMY_CTL: SIZE5 (Bit 0)                   */
#define SMIF_DEVICE_WR_DUMMY_CTL_SIZE5_Msk (0x1fUL)             /*!< SMIF_DEVICE WR_DUMMY_CTL: SIZE5 (Bitfield-Mask: 0x1f)     */
#define SMIF_DEVICE_WR_DUMMY_CTL_PRESENT_Pos (31UL)             /*!< SMIF_DEVICE WR_DUMMY_CTL: PRESENT (Bit 31)                */
#define SMIF_DEVICE_WR_DUMMY_CTL_PRESENT_Msk (0x80000000UL)     /*!< SMIF_DEVICE WR_DUMMY_CTL: PRESENT (Bitfield-Mask: 0x01)   */
/* ================================================  SMIF_DEVICE.WR_DATA_CTL  ================================================ */
#define SMIF_DEVICE_WR_DATA_CTL_WIDTH_Pos (16UL)                /*!< SMIF_DEVICE WR_DATA_CTL: WIDTH (Bit 16)                   */
#define SMIF_DEVICE_WR_DATA_CTL_WIDTH_Msk (0x30000UL)           /*!< SMIF_DEVICE WR_DATA_CTL: WIDTH (Bitfield-Mask: 0x03)      */


