ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_smif.h
/* =======================================================  SMIF.CTL  ======================================================== */
#define SMIF_CTL_XIP_MODE_Pos             (0UL)                 /*!< SMIF CTL: XIP_MODE (Bit 0)                                */
#define SMIF_CTL_XIP_MODE_Msk             (0x1UL)               /*!< SMIF CTL: XIP_MODE (Bitfield-Mask: 0x01)                  */
#define SMIF_CTL_CLOCK_IF_RX_SEL_Pos      (12UL)                /*!< SMIF CTL: CLOCK_IF_RX_SEL (Bit 12)                        */
#define SMIF_CTL_CLOCK_IF_RX_SEL_Msk      (0x3000UL)            /*!< SMIF CTL: CLOCK_IF_RX_SEL (Bitfield-Mask: 0x03)           */
#define SMIF_CTL_DESELECT_DELAY_Pos       (16UL)                /*!< SMIF CTL: DESELECT_DELAY (Bit 16)                         */
#define SMIF_CTL_DESELECT_DELAY_Msk       (0x70000UL)           /*!< SMIF CTL: DESELECT_DELAY (Bitfield-Mask: 0x07)            */
#define SMIF_CTL_BLOCK_Pos                (24UL)                /*!< SMIF CTL: BLOCK (Bit 24)                                  */
#define SMIF_CTL_BLOCK_Msk                (0x1000000UL)         /*!< SMIF CTL: BLOCK (Bitfield-Mask: 0x01)                     */
#define SMIF_CTL_ENABLED_Pos              (31UL)                /*!< SMIF CTL: ENABLED (Bit 31)                                */
#define SMIF_CTL_ENABLED_Msk              (0x80000000UL)        /*!< SMIF CTL: ENABLED (Bitfield-Mask: 0x01)                   */
/* ======================================================  SMIF.STATUS  ====================================================== */
#define SMIF_STATUS_BUSY_Pos              (31UL)                /*!< SMIF STATUS: BUSY (Bit 31)                                */
#define SMIF_STATUS_BUSY_Msk              (0x80000000UL)        /*!< SMIF STATUS: BUSY (Bitfield-Mask: 0x01)                   */
/* ================================================  SMIF.TX_CMD_FIFO_STATUS  ================================================ */
#define SMIF_TX_CMD_FIFO_STATUS_USED3_Pos (0UL)                 /*!< SMIF TX_CMD_FIFO_STATUS: USED3 (Bit 0)                    */
#define SMIF_TX_CMD_FIFO_STATUS_USED3_Msk (0x7UL)               /*!< SMIF TX_CMD_FIFO_STATUS: USED3 (Bitfield-Mask: 0x07)      */
/* ==================================================  SMIF.TX_CMD_FIFO_WR  ================================================== */
#define SMIF_TX_CMD_FIFO_WR_DATA20_Pos    (0UL)                 /*!< SMIF TX_CMD_FIFO_WR: DATA20 (Bit 0)                       */
#define SMIF_TX_CMD_FIFO_WR_DATA20_Msk    (0xfffffUL)           /*!< SMIF TX_CMD_FIFO_WR: DATA20 (Bitfield-Mask: 0xfffff)      */
/* =================================================  SMIF.TX_DATA_FIFO_CTL  ================================================= */
#define SMIF_TX_DATA_FIFO_CTL_TRIGGER_LEVEL_Pos (0UL)           /*!< SMIF TX_DATA_FIFO_CTL: TRIGGER_LEVEL (Bit 0)              */
#define SMIF_TX_DATA_FIFO_CTL_TRIGGER_LEVEL_Msk (0x7UL)         /*!< SMIF TX_DATA_FIFO_CTL: TRIGGER_LEVEL (Bitfield-Mask: 0x07)*/
/* ===============================================  SMIF.TX_DATA_FIFO_STATUS  ================================================ */
#define SMIF_TX_DATA_FIFO_STATUS_USED4_Pos (0UL)                /*!< SMIF TX_DATA_FIFO_STATUS: USED4 (Bit 0)                   */
#define SMIF_TX_DATA_FIFO_STATUS_USED4_Msk (0xfUL)              /*!< SMIF TX_DATA_FIFO_STATUS: USED4 (Bitfield-Mask: 0x0f)     */
/* =================================================  SMIF.TX_DATA_FIFO_WR1  ================================================= */
#define SMIF_TX_DATA_FIFO_WR1_DATA0_Pos   (0UL)                 /*!< SMIF TX_DATA_FIFO_WR1: DATA0 (Bit 0)                      */
#define SMIF_TX_DATA_FIFO_WR1_DATA0_Msk   (0xffUL)              /*!< SMIF TX_DATA_FIFO_WR1: DATA0 (Bitfield-Mask: 0xff)        */
/* =================================================  SMIF.TX_DATA_FIFO_WR2  ================================================= */
#define SMIF_TX_DATA_FIFO_WR2_DATA0_Pos   (0UL)                 /*!< SMIF TX_DATA_FIFO_WR2: DATA0 (Bit 0)                      */
#define SMIF_TX_DATA_FIFO_WR2_DATA0_Msk   (0xffUL)              /*!< SMIF TX_DATA_FIFO_WR2: DATA0 (Bitfield-Mask: 0xff)        */
#define SMIF_TX_DATA_FIFO_WR2_DATA1_Pos   (8UL)                 /*!< SMIF TX_DATA_FIFO_WR2: DATA1 (Bit 8)                      */
#define SMIF_TX_DATA_FIFO_WR2_DATA1_Msk   (0xff00UL)            /*!< SMIF TX_DATA_FIFO_WR2: DATA1 (Bitfield-Mask: 0xff)        */
/* =================================================  SMIF.TX_DATA_FIFO_WR4  ================================================= */
#define SMIF_TX_DATA_FIFO_WR4_DATA0_Pos   (0UL)                 /*!< SMIF TX_DATA_FIFO_WR4: DATA0 (Bit 0)                      */
#define SMIF_TX_DATA_FIFO_WR4_DATA0_Msk   (0xffUL)              /*!< SMIF TX_DATA_FIFO_WR4: DATA0 (Bitfield-Mask: 0xff)        */
#define SMIF_TX_DATA_FIFO_WR4_DATA1_Pos   (8UL)                 /*!< SMIF TX_DATA_FIFO_WR4: DATA1 (Bit 8)                      */
#define SMIF_TX_DATA_FIFO_WR4_DATA1_Msk   (0xff00UL)            /*!< SMIF TX_DATA_FIFO_WR4: DATA1 (Bitfield-Mask: 0xff)        */
#define SMIF_TX_DATA_FIFO_WR4_DATA2_Pos   (16UL)                /*!< SMIF TX_DATA_FIFO_WR4: DATA2 (Bit 16)                     */
#define SMIF_TX_DATA_FIFO_WR4_DATA2_Msk   (0xff0000UL)          /*!< SMIF TX_DATA_FIFO_WR4: DATA2 (Bitfield-Mask: 0xff)        */
#define SMIF_TX_DATA_FIFO_WR4_DATA3_Pos   (24UL)                /*!< SMIF TX_DATA_FIFO_WR4: DATA3 (Bit 24)                     */
#define SMIF_TX_DATA_FIFO_WR4_DATA3_Msk   (0xff000000UL)        /*!< SMIF TX_DATA_FIFO_WR4: DATA3 (Bitfield-Mask: 0xff)        */
/* =================================================  SMIF.RX_DATA_FIFO_CTL  ================================================= */
#define SMIF_RX_DATA_FIFO_CTL_TRIGGER_LEVEL_Pos (0UL)           /*!< SMIF RX_DATA_FIFO_CTL: TRIGGER_LEVEL (Bit 0)              */
#define SMIF_RX_DATA_FIFO_CTL_TRIGGER_LEVEL_Msk (0x7UL)         /*!< SMIF RX_DATA_FIFO_CTL: TRIGGER_LEVEL (Bitfield-Mask: 0x07)*/
/* ===============================================  SMIF.RX_DATA_FIFO_STATUS  ================================================ */
#define SMIF_RX_DATA_FIFO_STATUS_USED4_Pos (0UL)                /*!< SMIF RX_DATA_FIFO_STATUS: USED4 (Bit 0)                   */
#define SMIF_RX_DATA_FIFO_STATUS_USED4_Msk (0xfUL)              /*!< SMIF RX_DATA_FIFO_STATUS: USED4 (Bitfield-Mask: 0x0f)     */
/* =================================================  SMIF.RX_DATA_FIFO_RD1  ================================================= */
#define SMIF_RX_DATA_FIFO_RD1_DATA0_Pos   (0UL)                 /*!< SMIF RX_DATA_FIFO_RD1: DATA0 (Bit 0)                      */
#define SMIF_RX_DATA_FIFO_RD1_DATA0_Msk   (0xffUL)              /*!< SMIF RX_DATA_FIFO_RD1: DATA0 (Bitfield-Mask: 0xff)        */
/* =================================================  SMIF.RX_DATA_FIFO_RD2  ================================================= */
#define SMIF_RX_DATA_FIFO_RD2_DATA0_Pos   (0UL)                 /*!< SMIF RX_DATA_FIFO_RD2: DATA0 (Bit 0)                      */
#define SMIF_RX_DATA_FIFO_RD2_DATA0_Msk   (0xffUL)              /*!< SMIF RX_DATA_FIFO_RD2: DATA0 (Bitfield-Mask: 0xff)        */
#define SMIF_RX_DATA_FIFO_RD2_DATA1_Pos   (8UL)                 /*!< SMIF RX_DATA_FIFO_RD2: DATA1 (Bit 8)                      */
#define SMIF_RX_DATA_FIFO_RD2_DATA1_Msk   (0xff00UL)            /*!< SMIF RX_DATA_FIFO_RD2: DATA1 (Bitfield-Mask: 0xff)        */
/* =================================================  SMIF.RX_DATA_FIFO_RD4  ================================================= */
#define SMIF_RX_DATA_FIFO_RD4_DATA0_Pos   (0UL)                 /*!< SMIF RX_DATA_FIFO_RD4: DATA0 (Bit 0)                      */
#define SMIF_RX_DATA_FIFO_RD4_DATA0_Msk   (0xffUL)              /*!< SMIF RX_DATA_FIFO_RD4: DATA0 (Bitfield-Mask: 0xff)        */
#define SMIF_RX_DATA_FIFO_RD4_DATA1_Pos   (8UL)                 /*!< SMIF RX_DATA_FIFO_RD4: DATA1 (Bit 8)                      */
#define SMIF_RX_DATA_FIFO_RD4_DATA1_Msk   (0xff00UL)            /*!< SMIF RX_DATA_FIFO_RD4: DATA1 (Bitfield-Mask: 0xff)        */
#define SMIF_RX_DATA_FIFO_RD4_DATA2_Pos   (16UL)                /*!< SMIF RX_DATA_FIFO_RD4: DATA2 (Bit 16)                     */
#define SMIF_RX_DATA_FIFO_RD4_DATA2_Msk   (0xff0000UL)          /*!< SMIF RX_DATA_FIFO_RD4: DATA2 (Bitfield-Mask: 0xff)        */
#define SMIF_RX_DATA_FIFO_RD4_DATA3_Pos   (24UL)                /*!< SMIF RX_DATA_FIFO_RD4: DATA3 (Bit 24)                     */
#define SMIF_RX_DATA_FIFO_RD4_DATA3_Msk   (0xff000000UL)        /*!< SMIF RX_DATA_FIFO_RD4: DATA3 (Bitfield-Mask: 0xff)        */
/* =============================================  SMIF.RX_DATA_FIFO_RD1_SILENT  ============================================== */
#define SMIF_RX_DATA_FIFO_RD1_SILENT_DATA0_Pos (0UL)            /*!< SMIF RX_DATA_FIFO_RD1_SILENT: DATA0 (Bit 0)               */
#define SMIF_RX_DATA_FIFO_RD1_SILENT_DATA0_Msk (0xffUL)         /*!< SMIF RX_DATA_FIFO_RD1_SILENT: DATA0 (Bitfield-Mask: 0xff) */
/* ===================================================  SMIF.SLOW_CA_CTL  ==================================================== */
#define SMIF_SLOW_CA_CTL_WAY_Pos          (16UL)                /*!< SMIF SLOW_CA_CTL: WAY (Bit 16)                            */
#define SMIF_SLOW_CA_CTL_WAY_Msk          (0x30000UL)           /*!< SMIF SLOW_CA_CTL: WAY (Bitfield-Mask: 0x03)               */
#define SMIF_SLOW_CA_CTL_SET_ADDR_Pos     (24UL)                /*!< SMIF SLOW_CA_CTL: SET_ADDR (Bit 24)                       */
#define SMIF_SLOW_CA_CTL_SET_ADDR_Msk     (0x3000000UL)         /*!< SMIF SLOW_CA_CTL: SET_ADDR (Bitfield-Mask: 0x03)          */
#define SMIF_SLOW_CA_CTL_PREF_EN_Pos      (30UL)                /*!< SMIF SLOW_CA_CTL: PREF_EN (Bit 30)                        */
#define SMIF_SLOW_CA_CTL_PREF_EN_Msk      (0x40000000UL)        /*!< SMIF SLOW_CA_CTL: PREF_EN (Bitfield-Mask: 0x01)           */
#define SMIF_SLOW_CA_CTL_ENABLED_Pos      (31UL)                /*!< SMIF SLOW_CA_CTL: ENABLED (Bit 31)                        */
#define SMIF_SLOW_CA_CTL_ENABLED_Msk      (0x80000000UL)        /*!< SMIF SLOW_CA_CTL: ENABLED (Bitfield-Mask: 0x01)           */
/* ===================================================  SMIF.SLOW_CA_CMD  ==================================================== */
#define SMIF_SLOW_CA_CMD_INV_Pos          (0UL)                 /*!< SMIF SLOW_CA_CMD: INV (Bit 0)                             */
#define SMIF_SLOW_CA_CMD_INV_Msk          (0x1UL)               /*!< SMIF SLOW_CA_CMD: INV (Bitfield-Mask: 0x01)               */
/* =================================================  SMIF.SLOW_CA_STATUS0  ================================================== */
#define SMIF_SLOW_CA_STATUS0_VALID16_Pos  (0UL)                 /*!< SMIF SLOW_CA_STATUS0: VALID16 (Bit 0)                     */
#define SMIF_SLOW_CA_STATUS0_VALID16_Msk  (0xffffUL)            /*!< SMIF SLOW_CA_STATUS0: VALID16 (Bitfield-Mask: 0xffff)     */
/* =================================================  SMIF.SLOW_CA_STATUS1  ================================================== */
#define SMIF_SLOW_CA_STATUS1_TAG_Pos      (0UL)                 /*!< SMIF SLOW_CA_STATUS1: TAG (Bit 0)                         */
#define SMIF_SLOW_CA_STATUS1_TAG_Msk      (0xffffffffUL)        /*!< SMIF SLOW_CA_STATUS1: TAG (Bitfield-Mask: 0xffffffff)     */
/* =================================================  SMIF.SLOW_CA_STATUS2  ================================================== */
#define SMIF_SLOW_CA_STATUS2_LRU_Pos      (0UL)                 /*!< SMIF SLOW_CA_STATUS2: LRU (Bit 0)                         */
#define SMIF_SLOW_CA_STATUS2_LRU_Msk      (0x3fUL)              /*!< SMIF SLOW_CA_STATUS2: LRU (Bitfield-Mask: 0x3f)           */
/* ===================================================  SMIF.FAST_CA_CTL  ==================================================== */
#define SMIF_FAST_CA_CTL_WAY_Pos          (16UL)                /*!< SMIF FAST_CA_CTL: WAY (Bit 16)                            */
#define SMIF_FAST_CA_CTL_WAY_Msk          (0x30000UL)           /*!< SMIF FAST_CA_CTL: WAY (Bitfield-Mask: 0x03)               */
#define SMIF_FAST_CA_CTL_SET_ADDR_Pos     (24UL)                /*!< SMIF FAST_CA_CTL: SET_ADDR (Bit 24)                       */
#define SMIF_FAST_CA_CTL_SET_ADDR_Msk     (0x3000000UL)         /*!< SMIF FAST_CA_CTL: SET_ADDR (Bitfield-Mask: 0x03)          */
#define SMIF_FAST_CA_CTL_PREF_EN_Pos      (30UL)                /*!< SMIF FAST_CA_CTL: PREF_EN (Bit 30)                        */
#define SMIF_FAST_CA_CTL_PREF_EN_Msk      (0x40000000UL)        /*!< SMIF FAST_CA_CTL: PREF_EN (Bitfield-Mask: 0x01)           */
#define SMIF_FAST_CA_CTL_ENABLED_Pos      (31UL)                /*!< SMIF FAST_CA_CTL: ENABLED (Bit 31)                        */
#define SMIF_FAST_CA_CTL_ENABLED_Msk      (0x80000000UL)        /*!< SMIF FAST_CA_CTL: ENABLED (Bitfield-Mask: 0x01)           */
/* ===================================================  SMIF.FAST_CA_CMD  ==================================================== */
#define SMIF_FAST_CA_CMD_INV_Pos          (0UL)                 /*!< SMIF FAST_CA_CMD: INV (Bit 0)                             */
#define SMIF_FAST_CA_CMD_INV_Msk          (0x1UL)               /*!< SMIF FAST_CA_CMD: INV (Bitfield-Mask: 0x01)               */
/* =================================================  SMIF.FAST_CA_STATUS0  ================================================== */
#define SMIF_FAST_CA_STATUS0_VALID16_Pos  (0UL)                 /*!< SMIF FAST_CA_STATUS0: VALID16 (Bit 0)                     */
#define SMIF_FAST_CA_STATUS0_VALID16_Msk  (0xffffUL)            /*!< SMIF FAST_CA_STATUS0: VALID16 (Bitfield-Mask: 0xffff)     */
/* =================================================  SMIF.FAST_CA_STATUS1  ================================================== */
#define SMIF_FAST_CA_STATUS1_TAG_Pos      (0UL)                 /*!< SMIF FAST_CA_STATUS1: TAG (Bit 0)                         */
#define SMIF_FAST_CA_STATUS1_TAG_Msk      (0xffffffffUL)        /*!< SMIF FAST_CA_STATUS1: TAG (Bitfield-Mask: 0xffffffff)     */
/* =================================================  SMIF.FAST_CA_STATUS2  ================================================== */
#define SMIF_FAST_CA_STATUS2_LRU_Pos      (0UL)                 /*!< SMIF FAST_CA_STATUS2: LRU (Bit 0)                         */
#define SMIF_FAST_CA_STATUS2_LRU_Msk      (0x3fUL)              /*!< SMIF FAST_CA_STATUS2: LRU (Bitfield-Mask: 0x3f)           */
/* ====================================================  SMIF.CRYPTO_CMD  ==================================================== */
#define SMIF_CRYPTO_CMD_START_Pos         (0UL)                 /*!< SMIF CRYPTO_CMD: START (Bit 0)                            */
#define SMIF_CRYPTO_CMD_START_Msk         (0x1UL)               /*!< SMIF CRYPTO_CMD: START (Bitfield-Mask: 0x01)              */
/* ==================================================  SMIF.CRYPTO_INPUT0  =================================================== */
#define SMIF_CRYPTO_INPUT0_INPUT_Pos      (0UL)                 /*!< SMIF CRYPTO_INPUT0: INPUT (Bit 0)                         */
#define SMIF_CRYPTO_INPUT0_INPUT_Msk      (0xffffffffUL)        /*!< SMIF CRYPTO_INPUT0: INPUT (Bitfield-Mask: 0xffffffff)     */
/* ==================================================  SMIF.CRYPTO_INPUT1  =================================================== */
#define SMIF_CRYPTO_INPUT1_INPUT_Pos      (0UL)                 /*!< SMIF CRYPTO_INPUT1: INPUT (Bit 0)                         */
#define SMIF_CRYPTO_INPUT1_INPUT_Msk      (0xffffffffUL)        /*!< SMIF CRYPTO_INPUT1: INPUT (Bitfield-Mask: 0xffffffff)     */
/* ==================================================  SMIF.CRYPTO_INPUT2  =================================================== */
#define SMIF_CRYPTO_INPUT2_INPUT_Pos      (0UL)                 /*!< SMIF CRYPTO_INPUT2: INPUT (Bit 0)                         */
#define SMIF_CRYPTO_INPUT2_INPUT_Msk      (0xffffffffUL)        /*!< SMIF CRYPTO_INPUT2: INPUT (Bitfield-Mask: 0xffffffff)     */
/* ==================================================  SMIF.CRYPTO_INPUT3  =================================================== */
#define SMIF_CRYPTO_INPUT3_INPUT_Pos      (0UL)                 /*!< SMIF CRYPTO_INPUT3: INPUT (Bit 0)                         */
#define SMIF_CRYPTO_INPUT3_INPUT_Msk      (0xffffffffUL)        /*!< SMIF CRYPTO_INPUT3: INPUT (Bitfield-Mask: 0xffffffff)     */
/* ===================================================  SMIF.CRYPTO_KEY0  ==================================================== */
#define SMIF_CRYPTO_KEY0_KEY_Pos          (0UL)                 /*!< SMIF CRYPTO_KEY0: KEY (Bit 0)                             */
#define SMIF_CRYPTO_KEY0_KEY_Msk          (0xffffffffUL)        /*!< SMIF CRYPTO_KEY0: KEY (Bitfield-Mask: 0xffffffff)         */
/* ===================================================  SMIF.CRYPTO_KEY1  ==================================================== */
#define SMIF_CRYPTO_KEY1_KEY_Pos          (0UL)                 /*!< SMIF CRYPTO_KEY1: KEY (Bit 0)                             */
#define SMIF_CRYPTO_KEY1_KEY_Msk          (0xffffffffUL)        /*!< SMIF CRYPTO_KEY1: KEY (Bitfield-Mask: 0xffffffff)         */
/* ===================================================  SMIF.CRYPTO_KEY2  ==================================================== */
#define SMIF_CRYPTO_KEY2_KEY_Pos          (0UL)                 /*!< SMIF CRYPTO_KEY2: KEY (Bit 0)                             */
#define SMIF_CRYPTO_KEY2_KEY_Msk          (0xffffffffUL)        /*!< SMIF CRYPTO_KEY2: KEY (Bitfield-Mask: 0xffffffff)         */
/* ===================================================  SMIF.CRYPTO_KEY3  ==================================================== */
#define SMIF_CRYPTO_KEY3_KEY_Pos          (0UL)                 /*!< SMIF CRYPTO_KEY3: KEY (Bit 0)                             */
#define SMIF_CRYPTO_KEY3_KEY_Msk          (0xffffffffUL)        /*!< SMIF CRYPTO_KEY3: KEY (Bitfield-Mask: 0xffffffff)         */
/* ==================================================  SMIF.CRYPTO_OUTPUT0  ================================================== */
#define SMIF_CRYPTO_OUTPUT0_OUTPUT_Pos    (0UL)                 /*!< SMIF CRYPTO_OUTPUT0: OUTPUT (Bit 0)                       */
#define SMIF_CRYPTO_OUTPUT0_OUTPUT_Msk    (0xffffffffUL)        /*!< SMIF CRYPTO_OUTPUT0: OUTPUT (Bitfield-Mask: 0xffffffff)   */
/* ==================================================  SMIF.CRYPTO_OUTPUT1  ================================================== */
#define SMIF_CRYPTO_OUTPUT1_OUTPUT_Pos    (0UL)                 /*!< SMIF CRYPTO_OUTPUT1: OUTPUT (Bit 0)                       */
#define SMIF_CRYPTO_OUTPUT1_OUTPUT_Msk    (0xffffffffUL)        /*!< SMIF CRYPTO_OUTPUT1: OUTPUT (Bitfield-Mask: 0xffffffff)   */
/* ==================================================  SMIF.CRYPTO_OUTPUT2  ================================================== */
#define SMIF_CRYPTO_OUTPUT2_OUTPUT_Pos    (0UL)                 /*!< SMIF CRYPTO_OUTPUT2: OUTPUT (Bit 0)                       */
#define SMIF_CRYPTO_OUTPUT2_OUTPUT_Msk    (0xffffffffUL)        /*!< SMIF CRYPTO_OUTPUT2: OUTPUT (Bitfield-Mask: 0xffffffff)   */
/* ==================================================  SMIF.CRYPTO_OUTPUT3  ================================================== */
#define SMIF_CRYPTO_OUTPUT3_OUTPUT_Pos    (0UL)                 /*!< SMIF CRYPTO_OUTPUT3: OUTPUT (Bit 0)                       */
#define SMIF_CRYPTO_OUTPUT3_OUTPUT_Msk    (0xffffffffUL)        /*!< SMIF CRYPTO_OUTPUT3: OUTPUT (Bitfield-Mask: 0xffffffff)   */
/* =======================================================  SMIF.INTR  ======================================================= */
#define SMIF_INTR_TR_TX_REQ_Pos           (0UL)                 /*!< SMIF INTR: TR_TX_REQ (Bit 0)                              */
#define SMIF_INTR_TR_TX_REQ_Msk           (0x1UL)               /*!< SMIF INTR: TR_TX_REQ (Bitfield-Mask: 0x01)                */
#define SMIF_INTR_TR_RX_REQ_Pos           (1UL)                 /*!< SMIF INTR: TR_RX_REQ (Bit 1)                              */
#define SMIF_INTR_TR_RX_REQ_Msk           (0x2UL)               /*!< SMIF INTR: TR_RX_REQ (Bitfield-Mask: 0x01)                */
#define SMIF_INTR_XIP_ALIGNMENT_ERROR_Pos (2UL)                 /*!< SMIF INTR: XIP_ALIGNMENT_ERROR (Bit 2)                    */
#define SMIF_INTR_XIP_ALIGNMENT_ERROR_Msk (0x4UL)               /*!< SMIF INTR: XIP_ALIGNMENT_ERROR (Bitfield-Mask: 0x01)      */
#define SMIF_INTR_TX_CMD_FIFO_OVERFLOW_Pos (3UL)                /*!< SMIF INTR: TX_CMD_FIFO_OVERFLOW (Bit 3)                   */
#define SMIF_INTR_TX_CMD_FIFO_OVERFLOW_Msk (0x8UL)              /*!< SMIF INTR: TX_CMD_FIFO_OVERFLOW (Bitfield-Mask: 0x01)     */
#define SMIF_INTR_TX_DATA_FIFO_OVERFLOW_Pos (4UL)               /*!< SMIF INTR: TX_DATA_FIFO_OVERFLOW (Bit 4)                  */
#define SMIF_INTR_TX_DATA_FIFO_OVERFLOW_Msk (0x10UL)            /*!< SMIF INTR: TX_DATA_FIFO_OVERFLOW (Bitfield-Mask: 0x01)    */
#define SMIF_INTR_RX_DATA_FIFO_UNDERFLOW_Pos (5UL)              /*!< SMIF INTR: RX_DATA_FIFO_UNDERFLOW (Bit 5)                 */
#define SMIF_INTR_RX_DATA_FIFO_UNDERFLOW_Msk (0x20UL)           /*!< SMIF INTR: RX_DATA_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)   */
/* =====================================================  SMIF.INTR_SET  ===================================================== */
#define SMIF_INTR_SET_TR_TX_REQ_Pos       (0UL)                 /*!< SMIF INTR_SET: TR_TX_REQ (Bit 0)                          */
#define SMIF_INTR_SET_TR_TX_REQ_Msk       (0x1UL)               /*!< SMIF INTR_SET: TR_TX_REQ (Bitfield-Mask: 0x01)            */
#define SMIF_INTR_SET_TR_RX_REQ_Pos       (1UL)                 /*!< SMIF INTR_SET: TR_RX_REQ (Bit 1)                          */
#define SMIF_INTR_SET_TR_RX_REQ_Msk       (0x2UL)               /*!< SMIF INTR_SET: TR_RX_REQ (Bitfield-Mask: 0x01)            */
#define SMIF_INTR_SET_XIP_ALIGNMENT_ERROR_Pos (2UL)             /*!< SMIF INTR_SET: XIP_ALIGNMENT_ERROR (Bit 2)                */
#define SMIF_INTR_SET_XIP_ALIGNMENT_ERROR_Msk (0x4UL)           /*!< SMIF INTR_SET: XIP_ALIGNMENT_ERROR (Bitfield-Mask: 0x01)  */
#define SMIF_INTR_SET_TX_CMD_FIFO_OVERFLOW_Pos (3UL)            /*!< SMIF INTR_SET: TX_CMD_FIFO_OVERFLOW (Bit 3)               */
#define SMIF_INTR_SET_TX_CMD_FIFO_OVERFLOW_Msk (0x8UL)          /*!< SMIF INTR_SET: TX_CMD_FIFO_OVERFLOW (Bitfield-Mask: 0x01) */
#define SMIF_INTR_SET_TX_DATA_FIFO_OVERFLOW_Pos (4UL)           /*!< SMIF INTR_SET: TX_DATA_FIFO_OVERFLOW (Bit 4)              */
#define SMIF_INTR_SET_TX_DATA_FIFO_OVERFLOW_Msk (0x10UL)        /*!< SMIF INTR_SET: TX_DATA_FIFO_OVERFLOW (Bitfield-Mask: 0x01)*/
#define SMIF_INTR_SET_RX_DATA_FIFO_UNDERFLOW_Pos (5UL)          /*!< SMIF INTR_SET: RX_DATA_FIFO_UNDERFLOW (Bit 5)             */
#define SMIF_INTR_SET_RX_DATA_FIFO_UNDERFLOW_Msk (0x20UL)       /*!< SMIF INTR_SET: RX_DATA_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)*/
/* ====================================================  SMIF.INTR_MASK  ===================================================== */
#define SMIF_INTR_MASK_TR_TX_REQ_Pos      (0UL)                 /*!< SMIF INTR_MASK: TR_TX_REQ (Bit 0)                         */
#define SMIF_INTR_MASK_TR_TX_REQ_Msk      (0x1UL)               /*!< SMIF INTR_MASK: TR_TX_REQ (Bitfield-Mask: 0x01)           */
#define SMIF_INTR_MASK_TR_RX_REQ_Pos      (1UL)                 /*!< SMIF INTR_MASK: TR_RX_REQ (Bit 1)                         */
#define SMIF_INTR_MASK_TR_RX_REQ_Msk      (0x2UL)               /*!< SMIF INTR_MASK: TR_RX_REQ (Bitfield-Mask: 0x01)           */
#define SMIF_INTR_MASK_XIP_ALIGNMENT_ERROR_Pos (2UL)            /*!< SMIF INTR_MASK: XIP_ALIGNMENT_ERROR (Bit 2)               */
#define SMIF_INTR_MASK_XIP_ALIGNMENT_ERROR_Msk (0x4UL)          /*!< SMIF INTR_MASK: XIP_ALIGNMENT_ERROR (Bitfield-Mask: 0x01) */
#define SMIF_INTR_MASK_TX_CMD_FIFO_OVERFLOW_Pos (3UL)           /*!< SMIF INTR_MASK: TX_CMD_FIFO_OVERFLOW (Bit 3)              */
