ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_smif.h
#define SMIF_INTR_MASK_TX_CMD_FIFO_OVERFLOW_Msk (0x8UL)         /*!< SMIF INTR_MASK: TX_CMD_FIFO_OVERFLOW (Bitfield-Mask: 0x01)*/
#define SMIF_INTR_MASK_TX_DATA_FIFO_OVERFLOW_Pos (4UL)          /*!< SMIF INTR_MASK: TX_DATA_FIFO_OVERFLOW (Bit 4)             */
#define SMIF_INTR_MASK_TX_DATA_FIFO_OVERFLOW_Msk (0x10UL)       /*!< SMIF INTR_MASK: TX_DATA_FIFO_OVERFLOW (Bitfield-Mask: 0x01)*/
#define SMIF_INTR_MASK_RX_DATA_FIFO_UNDERFLOW_Pos (5UL)         /*!< SMIF INTR_MASK: RX_DATA_FIFO_UNDERFLOW (Bit 5)            */
#define SMIF_INTR_MASK_RX_DATA_FIFO_UNDERFLOW_Msk (0x20UL)      /*!< SMIF INTR_MASK: RX_DATA_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)*/
/* ===================================================  SMIF.INTR_MASKED  ==================================================== */
#define SMIF_INTR_MASKED_TR_TX_REQ_Pos    (0UL)                 /*!< SMIF INTR_MASKED: TR_TX_REQ (Bit 0)                       */
#define SMIF_INTR_MASKED_TR_TX_REQ_Msk    (0x1UL)               /*!< SMIF INTR_MASKED: TR_TX_REQ (Bitfield-Mask: 0x01)         */
#define SMIF_INTR_MASKED_TR_RX_REQ_Pos    (1UL)                 /*!< SMIF INTR_MASKED: TR_RX_REQ (Bit 1)                       */
#define SMIF_INTR_MASKED_TR_RX_REQ_Msk    (0x2UL)               /*!< SMIF INTR_MASKED: TR_RX_REQ (Bitfield-Mask: 0x01)         */
#define SMIF_INTR_MASKED_XIP_ALIGNMENT_ERROR_Pos (2UL)          /*!< SMIF INTR_MASKED: XIP_ALIGNMENT_ERROR (Bit 2)             */
#define SMIF_INTR_MASKED_XIP_ALIGNMENT_ERROR_Msk (0x4UL)        /*!< SMIF INTR_MASKED: XIP_ALIGNMENT_ERROR (Bitfield-Mask: 0x01)*/
#define SMIF_INTR_MASKED_TX_CMD_FIFO_OVERFLOW_Pos (3UL)         /*!< SMIF INTR_MASKED: TX_CMD_FIFO_OVERFLOW (Bit 3)            */
#define SMIF_INTR_MASKED_TX_CMD_FIFO_OVERFLOW_Msk (0x8UL)       /*!< SMIF INTR_MASKED: TX_CMD_FIFO_OVERFLOW (Bitfield-Mask: 0x01)*/
#define SMIF_INTR_MASKED_TX_DATA_FIFO_OVERFLOW_Pos (4UL)        /*!< SMIF INTR_MASKED: TX_DATA_FIFO_OVERFLOW (Bit 4)           */
#define SMIF_INTR_MASKED_TX_DATA_FIFO_OVERFLOW_Msk (0x10UL)     /*!< SMIF INTR_MASKED: TX_DATA_FIFO_OVERFLOW (Bitfield-Mask: 0x01)*/
#define SMIF_INTR_MASKED_RX_DATA_FIFO_UNDERFLOW_Pos (5UL)       /*!< SMIF INTR_MASKED: RX_DATA_FIFO_UNDERFLOW (Bit 5)          */
#define SMIF_INTR_MASKED_RX_DATA_FIFO_UNDERFLOW_Msk (0x20UL)    /*!< SMIF INTR_MASKED: RX_DATA_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)*/


#endif /* _CYIP_SMIF_H_ */


/* [] END OF FILE */
